{"resume": {"first_name": "Egor", "last_name": "Pianykh", "middle_name": null, "birth_date": null, "birth_date_year_only": false, "country": null, "city": null, "about": "A decent software engineer is looking to build expertise in distributed software at scale.", "key_skills": "Azure, C#, Java, Linux, Docker, Docker swarm mode, Cassandra, Elastic, Kibana, communication, PowerPoint, Excel, C++, .NET Framework, WPF, ASP.NET WebApi, Angular, Bootstrap, SQL Server, ExtJS", "salary_expectations_amount": null, "salary_expectations_currency": null, "gender": 1, "photo_path": null, "resume_name": null, "source_link": null, "resume_id": "19224", "contactItems": [{"value": "206-482-7070", "comment": "None", "contact_type": 1, "resume_contact_item_id": "67829"}, {"value": "egor.pianykh@gmail.com", "comment": "None", "contact_type": 2, "resume_contact_item_id": "56248"}], "educationItems": [{"year": "Bachelor degree in Applied Mathematics in East Ukrainian State University", "organization": "East Ukrainian State University", "faculty": "Applied Mathematics", "specialty": null, "result": null, "education_type": 4, "education_level": 4, "resume_education_item_id": "50555"}, {"year": "Deep Learning School by Moscow Institute of Physics and Technology (completed the first-semester study, to be completed in 2021)", "organization": "Moscow Institute of Physics and Technology", "faculty": null, "specialty": null, "result": null, "education_type": null, "education_level": null, "resume_education_item_id": "70686"}, {"year": "Deeplearning.ai specialization on coursera.org", "organization": "coursera.org", "faculty": null, "specialty": null, "result": null, "education_type": null, "education_level": null, "resume_education_item_id": "29855"}, {"year": "Machine Learning Scientist with Python on DataCamp.com", "organization": "DataCamp.com", "faculty": null, "specialty": null, "result": null, "education_type": null, "education_level": null, "resume_education_item_id": "40822"}], "experienceItems": [{"starts": "Jun 2016", "ends": "Jan 2017", "employer": "Private Equity Fund", "city": null, "url": null, "position": "Fullstack Engineer", "description": "Tracked a rare critical bug that was missed by dozens of eyes. Nobody knew how it was introduced to the system. Spent hundreds of hours researching codebase and experimenting with the CI/CD system. Successfully unblocked a team on their goal to unbind CRM from SQL Server. Merged an enormous amount of branches in git in a system with around 1500 active developers. Enabled my teammates to move faster and saved hundreds of development time by using my git expertise.", "resume_experience_item_id": "67634", "order": 0}, {"starts": "Jun 2017", "ends": "Oct 2019", "employer": "medical ultrasound machines", "city": null, "url": null, "position": "Senior Software Engineer", "description": "Designed and implemented a set of tools to reprogram faulty ultrasonic transducers in the field. This toolset saved over 20M dollars, avoiding the replacement of probes. And most importantly prevented ultrasonographers from cancer misdiagnosis. Implemented a workaround for a bug in the NVIDIA display driver that appears only with custom display and in out-of-support cards. This workaround could save thousands of hours of field engineers' work and millions of company losses. Fixed numerous hard to reproduce issues in legacy systems with over 2M lines of code and heavily dependent on global variables.", "resume_experience_item_id": "21858", "order": 1}, {"starts": "Jan 2017", "ends": "Mar 2017", "employer": "semiconductor burn-in oven automation", "city": null, "url": null, "position": "Tech Lead", "description": "Established the agile process, sprints and enabled my team on every demo. Designed a portal for configuring a semiconductor burn-in oven. Improved production floor operators' speed of work and reduced the number of defective batches by 5%. Led a team to the successful implementation of the project on time. Prevented the downtime for already installed equipment and enabling the next round of million dollars budgeting for a greater team. Facilitated collaboration between developers and business analysts.", "resume_experience_item_id": "15951", "order": 2}, {"starts": "Oct 2019", "ends": "May 2020", "employer": "legacy ECG devices", "city": null, "url": null, "position": "Project Coordinator", "description": "Provided technical leadership and direction to 35 software engineers, quality engineers, and business analysts. Facilitated collaboration between stakeholders and development teams and saved hundreds of work hours by minimizing the communication time gap. Represented a team on organization meetings, enabled quick issue resolution. Conducted cost-benefit analysis for remote customer support tooling. Presented the findings to a team of executives. The decision that was made saved a company hundreds of thousands of dollars per year. Led an effort to adjust APIs with a third-party vendor. Fast problem solving led to the timely release and avoided reputation losses to my client.", "resume_experience_item_id": "55377", "order": 3}, {"starts": "May 2020", "ends": "Nov 2020", "employer": "medical ECG monitoring", "city": null, "url": null, "position": "Software Engineer", "description": "Created an infrastructure as a code for on-prem Cassandra cluster deployments. This is a part of a system that will enable my client to deploy solutions to military hospitals and hospitals that prefer to manage their infrastructure. Implemented a metrics agent to monitor the health of the Cassandra cluster. The agent, along with the Kibana dashboard, will allow the ops team to monitor the cluster's health and provide appropriate SLA.", "resume_experience_item_id": "68054", "order": 4}], "languageItems": [{"language": "English", "language_level": 6, "resume_language_item_id": "71993"}, {"language": "Russian", "language_level": 7, "resume_language_item_id": "46007"}]}}