{"resume": {"first_name": "Alan", "last_name": "Abdirasul", "middle_name": null, "birth_date": null, "birth_date_year_only": false, "country": null, "city": null, "about": null, "key_skills": "Java, Kotlin, JavaScript, TypeScript, Spring boot, WebFlux, Gradle, Maven, RabbitMQ, Kafka, WebSocket, Spring Cloud, Hibernate, GraphQL, gRPC, PostgreSql, MySql, MongoDB, Redis, Oracle Database, R2DBC, React, Redux, HTML, CSS, Git, Github, Gitlab, CodeCommit, CI/CD, CircleCi, Jenkins, Grafana, Prometheus, Graphite, JUnit, Mockito, Docker, Kubernetes, AWS, Digital Ocean, Leadership, communication, problem-solving, adaptability, teamwork, time management, critical thinking, emotional intelligence", "salary_expectations_amount": null, "salary_expectations_currency": null, "gender": 1, "photo_path": null, "resume_name": "Senior Java Software Engineer", "source_link": null, "resume_id": "20325", "contactItems": [{"value": "aааааааbdirasul@gmail.com", "comment": null, "contact_type": 2, "resume_contact_item_id": "29056"}], "educationItems": [{"year": "2020", "organization": "Kirgizistan-Türkiye Manas Üniversitesi", "faculty": null, "specialty": "Computer Science", "result": null, "education_type": 4, "education_level": 5, "resume_education_item_id": "73921"}], "experienceItems": [{"starts": "2022", "ends": "Present", "employer": "Peaksoft", "city": "Chicago, Illinois USA", "url": null, "position": "Lead Java Software Engineer", "description": "Deployed and scaled applications on AWS. Effectively communicated within a multi-disciplined team, across 23 locations and 5 time zones. Managed task assignments and priorities for timely deliveries. Collaborated with stakeholders to prioritize system enhancements, boosting business process efficiency by 27%. Introduced pair programming, elevating code quality by 35% and accelerating project delivery. Orchestrated successful implementation of microservices architecture for improved scalability. Mentored and supported 18 junior and middle developers, enhancing code quality by 30%.", "resume_experience_item_id": "63197", "order": 0}, {"starts": "2021", "ends": "2022", "employer": "Peaksoft", "city": "Chicago, Illinois USA", "url": null, "position": "Senior Software Engineer", "description": "Enhanced application responsiveness and scalability through algorithm optimization. Skillfully integrated third-party systems, contributing to a 23% increase in global revenue. Implemented and optimized Grafana deployments, elevating application monitoring capabilities. Automated software delivery processes using CircleCI for efficient deployment.", "resume_experience_item_id": "50751", "order": 1}, {"starts": "2020", "ends": "2021", "employer": null, "city": "Bishkek, Kyrgyzstan", "url": null, "position": "Software Engineer", "description": "Optimized workflows, reducing development time by 25%. Orchestrated efficient communication across frontend, backend, and AQA teams, advancing deadlines by 12%. Guided 6 junior and middle developers, fostering growth and development. Engineered innovative features, including real-time grammar checking.", "resume_experience_item_id": "60993", "order": 2}, {"starts": "2018", "ends": "2020", "employer": "Inclusive Technology Aksoft", "city": "Bishkek, Kyrgyzstan", "url": null, "position": "Full-Stack Developer", "description": "Developed scalable applications using Java, JavaScript, React.js, and Redux.js. Optimized database designs and query performance, resulting in more efficient data management. Collaborated with cross-functional teams to gather requirements and deliver solutions tailored to client needs. Implemented CI/CD pipelines using CircleCI, achieving a significant 70% boost in deployment efficiency. Leveraged Docker for containerization, which reduced deployment time by 32% while improving the app's scalability. Managed projects efficiently through the use of Gradle and Maven, facilitating coordinated efforts. Leveraged Amazon S3 to enhance metadata storage and retrieval within Spring MVC projects.", "resume_experience_item_id": "99375", "order": 3}], "languageItems": [{"language": "English", "language_level": 6, "resume_language_item_id": "52382"}, {"language": "Russian", "language_level": 4, "resume_language_item_id": "58495"}]}}